from random import randint, shuffle
from kivy.app import App
from kivy.uix.screenmanager import ScreenManager, Screen
from kivy.uix.label import Label
from kivy.uix.boxlayout import BoxLayout
from kivy.uix.button import Button
from kivy.uix.togglebutton import ToggleButton
from kivy.uix.scrollview import ScrollView

def frb1(self):
    global a1
    global a2
    global a3
    a1 = True
    a2 = False
    a3 = False

def frb2(self):
    global a1
    global a2
    global a3
    a1 = False
    a2 = True
    a3 = False

def frb3(self):
    global a1
    global a2
    global a3
    a1 = False
    a2 = False
    a3 = True

class Quiz(App):
    def build(self):
        global scr2
        manager = ScreenManager()
        scr1 = Window1(name = "one")
        scr2 = Window2(name = "two")
        manager.add_widget(scr1)
        manager.add_widget(scr2)
        return manager

class Window1(Screen):
    def __init__(self, **kwargs):
        super().__init__(**kwargs)
        global radiobuttons
        global rb1
        global rb2
        global rb3
        global l1
        global correct_ans_index
        l1 = Label(font_size = "8sp")
        rb1 = ToggleButton(group = "group", font_size = "8sp")
        rb1.bind(on_press = frb1)
        rb2 = ToggleButton(group = "group", font_size = "8sp")
        rb2.bind(on_press = frb2)
        rb3 = ToggleButton(group = "group", font_size = "8sp")
        rb3.bind(on_press = frb3)
        pb1 = ScrBtn(self, "left", "two", text = "Υποβολή", font_size = "8sp")
        lv1 = BoxLayout(orientation = "vertical")
        lv1.add_widget(l1)
        radiobuttons = [rb1, rb2, rb3]
        for i in radiobuttons:
            lv1.add_widget(i)
        lv1.add_widget(pb1)
        index = randint(0, len(keys)-1)
        key = keys[index]
        l1.text = key
        shuffle(dictionary[key])
        lcounter = 0
        for i in dictionary[key]:
            if len(i[0]) > 1:
                radiobuttons[lcounter].text = i[0]
                correct_ans_index = lcounter
            else:
                radiobuttons[lcounter].text = i
            lcounter += 1
        keys.remove(keys[index])
        self.add_widget(lv1)

class Window2(Screen):
    def __init__(self, **kwargs):
        super().__init__(**kwargs)
        self.label = Label(text = "Τέλος του quiz!\nΠόντοι: " + str(points) + "\n\n", size_hint_y = None, font_size = "24sp", halign = "left", valign = "top")
        labeltext = self.label.text
        labeltext += "Οι ερωτήσεις με τις απαντήσεις:\n"
        for i in answers_db:
            labeltext += '\n'
            labeltext += i + " "
            labeltext += answers_db[i]
            labeltext += "\n"
        self.label.text = labeltext
        print(labeltext)
        self.label.bind(size = self.resize)        
        self.scroll = ScrollView(size_hint = (1, 1))
        self.scroll.add_widget(self.label)
        layout = BoxLayout(orientation = "vertical")
        layout.add_widget(self.scroll)
        self.add_widget(layout)
    def resize(self, *args):
        self.label.text_size = (self.label.width, None)
        self.label.texture_update()
        self.label.height = self.label.texture_size[1]

class ScrBtn(Button):
    def __init__(self, scrfrom, direction, scrto, **kwargs):
        super().__init__(**kwargs)
        self.scrfrom = scrfrom
        self.direction = direction
        self.scrto = scrto
    def on_press(self):
        global points
        global correct_ans_index
        if a1 and correct_ans_index == 0:
            points += 1
        elif a2 and correct_ans_index == 1:
            points += 1
        elif a3 and correct_ans_index == 2:
            points += 1
        self.show_q()
    def next(self):
        self.scrfrom.manager.transition.direction = self.direction
        self.scrfrom.manager.current = self.scrto
    def show_q(self):
        global keys
        global w
        global correct_ans_index
        if len(keys) == 0:
            scr2.label.text = "Τέλος του quiz!\nΠόντοι: " + str(points) + "\n\n"
            labeltext = scr2.label.text
            labeltext += "Οι ερωτήσεις με τις απαντήσεις:\n"
            for i in answers_db:
                labeltext += '\n'
                labeltext += i + " "
                labeltext += answers_db[i]
                labeltext += "\n"
            scr2.label.text = labeltext
            self.next()
        else:
            index = randint(0, len(keys)-1)
            key = keys[index]
            l1.text = key
            shuffle(dictionary[key])
            lcounter = 0
            for i in dictionary[key]:
                if len(i[0]) > 1:
                    radiobuttons[lcounter].text = i[0]
                    correct_ans_index = lcounter
                else:
                    radiobuttons[lcounter].text = i
                lcounter += 1
            keys.remove(keys[index])


keys = [
    "Αν κάποιος δημοσιεύσει προσωπικά μου στοίχεια παρά τη θελήση μου\n (φωτογραφικό υλικό ή γραπτό μύνημα) πώς πρέπει να δράσω;",
    "Κάποιος γνωστός μου, μου στέλνει προσωπικά στοιχεία όπως τηλέφωνο\n, pin καρτών, κτλ πώς αντιδρώ;",
    "Υπάρχουν διάφοροι χρήστες που εκφράζουν την άποψή τους πάνω σε ένα\n θέμα που είτε συμφωνώ είτε διαφωνώ, τι κάνω;",
    "Όταν θέλω να κάνω εγγραφή σε έναν ιστότοπο και μου λέει να κοινοποιήσω\n τα στοιχεία μου, τι κάνω;",
    "Λαμβάνω ένα mail από άγνωστο αποστολέα με έναν ιστότοπο παροτρύνοντας με\n να μπω, τι κάνω;",
    "Πώς καταλαβαίνω ότι ένας ιστότοπος είναι ασφαλής;",
    "Κάθε ιστότοπος ζητάει την αποδοχή όρων/ρυθμίσεων. Τι κάνω;",
    "Γνωρίζω κάποιον/α μέσω διαδικτυακού παιχνιδιού και μου ζητάει να συναντηθούμε.\n Τι κάνω;",
    "Βλέπω μια διαφήμιση στο διαδίκτυο ενός σκευάσματος αδυνατίσματος. Τι κάνω;",
    "Θέλω να αγοράσω ένα προιόν από το διαδίκτυο αλλά δεν μου φαίνεται\n έμπιστο το e-shop. Τι κάνω;",
    "Μου στέλνουν μήνυμα ότι κέρδισα χρήματα ή αντικείμενα μεγάλης αξίας. Τι κάνω;",
    "Κάποιος προσποιείται ότι είναι εσείς σε μια πλατφόρμα. Τι κάνεις;",
    "Χάκαραν κάποιον φίλο σας και σας στέλνουν από το προφίλ του\n <<προσωπικές>> φωτογραφίες του, τι κάνετε;",
    "Σου στέλνει κάποιος απειλιτικά μηνύματα μέσω τσατ κάποιας πλατφόρμας, τι κάνεις;",
    "Κάποιος σας στέλνει ένα ακατάλληλο βίντεο, τι κάνετε;",
    "Αν κάποιος/α συμμαθητής/τρια σου έστελνε μια άσεμνη φωτογραφία\n στο κινητό σου τι θα έκανες;"
]
dictionary = {
    "Αν κάποιος δημοσιεύσει προσωπικά μου στοίχεια παρά τη θελήση μου\n (φωτογραφικό υλικό ή γραπτό μύνημα) πώς πρέπει να δράσω;": ["Να ειδοποιήσω έναν φίλο μου", "Να στείλω σε αυτόν τον χρήστη μύνημα ώστε να το διαγράψει", ["Να ενημερώσω τους γονείς μου άμεσα"]],
    "Κάποιος γνωστός μου, μου στέλνει προσωπικά στοιχεία όπως τηλέφωνο\n, pin καρτών, κτλ πώς αντιδρώ;": ["Τα διαβάζω και του δίνω και δικά μου", "τα δημοσιεύω για πλάκα", ["του επισημαίνω να τα σβήσει και να τ' αλλάζει"]],
    "Υπάρχουν διάφοροι χρήστες που εκφράζουν την άποψή τους πάνω σε ένα\n θέμα που είτε συμφωνώ είτε διαφωνώ, τι κάνω;": ["Τους προσβάλω και τους αντιμιλάω", ["Εκφράζω την άποψή μου, με ευγένεια και επιχειρήματα"], "δεν ασχολούμαι καθόλου"],
    "Όταν θέλω να κάνω εγγραφή σε έναν ιστότοπο και μου λέει να κοινοποιήσω\n τα στοιχεία μου, τι κάνω;": ["Τα κοινοποιώ", "Δεν τα κοινοποιώ", ["Δεν κάνω πλήρη εγγραφή και δεν κοινοποιώ τα στοιχεία μου"]],
    "Λαμβάνω ένα mail από άγνωστο αποστολέα με έναν ιστότοπο παροτρύνοντας με\n να μπω, τι κάνω;": ["Τον ανοίγω και τον ακολουθώ", ["Δεν το ανοίγω"], "προωθώ το mail σε εναν φίλο μου"],
    "Πώς καταλαβαίνω ότι ένας ιστότοπος είναι ασφαλής;": [["Στα αρχικά HTTPS το γράμμα S σημαίνει secure οπότε μπορώ να επισκεφτώ αυτόν τον ιστότοπο"], "Μου το είπε ένας φίλος μου", "Δεν με νοιάζει αν ένας ιστότοπος είναι ασφαλής"],
    "Κάθε ιστότοπος ζητάει την αποδοχή όρων/ρυθμίσεων. Τι κάνω;": ["Αποδέχομαι τα πάντα", ["Διαβάζω τους όρους και αποδέχομαι τους λιγότερο επιβλαβείς"], "Δεν μπαίνω καθόλου στον ιστότοπο"],
    "Γνωρίζω κάποιον/α μέσω διαδικτυακού παιχνιδιού και μου ζητάει να συναντηθούμε.\n Τι κάνω;": ["Κανονίζω ραντεβού συνάντησης", "Δεν συναντιέμαι μαζί του", ["Κανονίζω συνάντηση σε δημόσιο χώρο με την συνοδεία του κηδεμόνα μου"]],
    "Βλέπω μια διαφήμιση στο διαδίκτυο ενός σκευάσματος αδυνατίσματος. Τι κάνω;": ["Το αγοράζω άμεσα και το χρησιμοποιώ", ["Συνήθως δεν έχω εμπιστοσύνη στις διαδικτυακές διαφημίσεις οπότε δεν το αγοράζω"], "Το προτείνω σε φίλους μου"],
    "Θέλω να αγοράσω ένα προιόν από το διαδίκτυο αλλά δεν μου φαίνεται\n έμπιστο το e-shop. Τι κάνω;": [["Αγοράζω μόνο από e-shop που διαθέτουν τις νόμιμες προδιαγραφές"], "Το αγοράζω με αντικαταβολή", "Το αγοράζω χρησιμοποιώντας πιστωτική κάρτα"],
    "Μου στέλνουν μήνυμα ότι κέρδισα χρήματα ή αντικείμενα μεγάλης αξίας. Τι κάνω;": ["Πατάω εκεί που λέει και αισθάνομαι τυχερός που κέρδισα", ["Το αγνοώ"], "Το κάνω προώθηση στον/στην φίλο/η μου για να κερδίσει και αυτός/η"],
    "Κάποιος προσποιείται ότι είναι εσείς σε μια πλατφόρμα. Τι κάνεις;": [["Αναφορά και μπλοκ"], "Τον απειλείτε με κάποιον τρόπο", "τίποτα"],
    "Χάκαραν κάποιον φίλο σας και σας στέλνουν από το προφίλ του\n <<προσωπικές>> φωτογραφίες του, τι κάνετε;": [["Άμεση ενημέρωση του φίλου και μπλόκ με αναφορά στο προφίλ"], "Το δείχνετε σε φίλους σας", "Το αγνοείτε"],
    "Σου στέλνει κάποιος απειλιτικά μηνύματα μέσω τσατ κάποιας πλατφόρμας, τι κάνεις;": ["Τον απειλείς και εσύ", ["Αναφορά και μπλόκ"], "Τίποτα"],
    "Κάποιος σας στέλνει ένα ακατάλληλο βίντεο, τι κάνετε;": ["Το βλέπετε", "Το κοινοποιείτε", ["Μπλοκ και αναφορά"]],
    "Αν κάποιος/α συμμαθητής/τρια σου έστελνε μια άσεμνη φωτογραφία\n στο κινητό σου τι θα έκανες;": ["Θα την έστελνα και εγώ σε άλλους", ["Θα την διέγραφα"], "Θα έγραφα σχόλιο"]
}
answers_db = {
    "Αν κάποιος δημοσιεύσει προσωπικά μου στοίχεια παρά τη θελήση μου (φωτογραφικό υλικό ή γραπτό μύνημα) πώς πρέπει να δράσω;": "Να ενημερώσω τους γονείς μου άμεσα",
    "Κάποιος γνωστός μου, μου στέλνει προσωπικά στοιχεία όπως τηλέφωνο, pin καρτών, κτλ πώς αντιδρώ;": "του επισημαίνω να τα σβήσει και να τ' αλλάζει",
    "Υπάρχουν διάφοροι χρήστες που εκφράζουν την άποψή τους πάνω σε ένα θέμα που είτε συμφωνώ είτε διαφωνώ, τι κάνω;": "Εκφράζω την άποψή μου, με ευγένεια και επιχειρήματα",
    "Όταν θέλω να κάνω εγγραφή σε έναν ιστότοπο και μου λέει να κοινοποιήσω τα στοιχεία μου, τι κάνω;": "Δεν κάνω πλήρη εγγραφή και δεν κοινοποιώ τα στοιχεία μου",
    "Λαμβάνω ένα mail από άγνωστο αποστολέα με έναν ιστότοπο παροτρύνοντας με να μπω, τι κάνω;": "Δεν το ανοίγω",
    "Πώς καταλαβαίνω ότι ένας ιστότοπος είναι ασφαλής;": "Στα αρχικά HTTPS το γράμμα S σημαίνει secure οπότε μπορώ να επισκεφτώ αυτόν τον ιστότοπο",
    "Κάθε ιστότοπος ζητάει την αποδοχή όρων/ρυθμίσεων. Τι κάνω;": "Διαβάζω τους όρους και αποδέχομαι τους λιγότερο επιβλαβείς",
    "Γνωρίζω κάποιον/α μέσω διαδικτυακού παιχνιδιού και μου ζητάει να συναντηθούμε. Τι κάνω;": "Κανονίζω συνάντηση σε δημόσιο χώρο με την συνοδεία του κηδεμόνα μου",
    "Βλέπω μια διαφήμιση στο διαδίκτυο ενός σκευάσματος αδυνατίσματος. Τι κάνω;": "Συνήθως δεν έχω εμπιστοσύνη στις διαδικτυακές διαφημίσεις οπότε δεν το αγοράζω",
    "Θέλω να αγοράσω ένα προιόν από το διαδίκτυο αλλά δεν μου φαίνεται έμπιστο το e-shop. Τι κάνω;": "Αγοράζω μόνο από e-shop που διαθέτουν τις νόμιμες προδιαγραφές",
    "Μου στέλνουν μήνυμα ότι κέρδισα χρήματα ή αντικείμενα μεγάλης αξίας. Τι κάνω;": "Το αγνοώ",
    "Κάποιος προσποιείται ότι είναι εσείς σε μια πλατφόρμα. Τι κάνεις;": "Αναφορά και μπλοκ",
    "Χάκαραν κάποιον φίλο σας και σας στέλνουν από το προφίλ του <<προσωπικές>> φωτογραφίες του, τι κάνετε;": "Άμεση ενημέρωση του φίλου και μπλόκ με αναφορά στο προφίλ",
    "Σου στέλνει κάποιος απειλιτικά μηνύματα μέσω τσατ κάποιας πλατφόρμας, τι κάνεις;": "Αναφορά και μπλόκ",
    "Κάποιος σας στέλνει ένα ακατάλληλο βίντεο, τι κάνετε;": "Μπλοκ και αναφορά",
    "Αν κάποιος/α συμμαθητής/τρια σου έστελνε μια άσεμνη φωτογραφία\n στο κινητό σου τι θα έκανες;": "Θα την διέγραφα"
}
a1 = False
a2 = False
a3 = False
points = 0
app = Quiz()
app.run()